[
  "Considering the relative positions of the window (annotated by the red box) and the table in the image provided, where is the window (annotated by the red box) located with respect to the table? Select from the following choices.",
  "Where is the person standing in relation to the recycle bin?",
  "What is the name of the barge on the left side of the image?",
  "What's the text written on the signboard in the image?",
  "What is the phone number listed on the building in the foreground?",
  "What is the registration number of the boat?",
  "How many dogs are being walked in the image?",
  "What's the relative position of the orange building compared to the cylindrical green building?",
  "What type of gloves is the person in the background wearing?",
  "What is the material of the ceiling beams in the room?",
  "What is the object located in the center of the grassy area?",
  "What piece of equipment is prominently visible in the person's possession?",
  "What kind of animal is in the poster?",
  "What is the time shown on the clock?",
  "What is the year inscribed on the sundial?",
  "What is the sum of the sales for Item 1 and Item 6?",
  "Which brand is mentioned on the black rectangular device located at the left of the image?",
  "Which country's flag is on the left?",
  "Who is the founder of the company that makes the square white adapter shown in the image?",
  "Which president's face is highlighted in the red rectangle on Mount Rushmore?",
  "What street is indicated by the sign on the pole near the center bottom of the image?",
  "What is the direction indicated on the sign pointing towards Zaragoza?",
  "What is the name of the place mentioned on the signboard above the left door?",
  "What does the Chinese text in the red rectangle translate to in English?",
  "On the provided map, which two numbered locations belong to the same country?",
  "Tell me the shape of the signboard attached to the building?",
  "What is the speed limit indicated by the sign in the image?",
  "What is the message written on the sign?",
  "What is the building behind the statue?",
  "What is the primary function of the object in the red circle?",
  "What direction are the chairs facing in the image?"
]